{
  "recipeList": [
    {
      "ingredients": [
        "Spaghetti",
        "Butter",
        "Peppercorn",
        "Parmesan"
      ],
      "detailedIngredients": [
        "200g spaghetti",
        "25g butter",
        "2tsp peppercorns",
        "50g parmesan"
      ],
      "name": "Cacio e pepe",
      "description": "Cook the pasta for 2 mins less than pack instructions state, in salted boiling water. Meanwhile, melt the butter in a medium frying pan over a low heat, then add the ground black pepper and toast for a few minutes. Drain the pasta, keeping 200ml of the pasta water. Tip the pasta and 100ml of the pasta water into the pan with the butter and pepper. Toss briefly, then scatter over the parmesan evenly, but don’t stir – wait for the cheese to melt for 30 seconds, then once melted, toss everything well, and stir together. This prevents the cheese from clumping or going stringy and makes a smooth, shiny sauce. Add a splash more pasta water if you need to, to loosen the sauce and coat the pasta. Serve immediately with a good grating of black pepper.",
      "time": "15 mins",
      "serves": "2",
      "imgSrc": "https://www.seriouseats.com/thmb/px_e8tCpfU7pcNvn4-j3bzQ9kGI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/spaghetti-cacio-e-pepe-recipe-hero-02_1-70880518badb4d428f5d5b03d303fabc.JPG"
    },
    {
      "ingredients": [
        "Chicken breast",
        "Puff pastry",
        "Garlic & herb cream cheese",
        "Lemon",
        "Olive oil",
        "Green bean",
        "Broccoli"
      ],
      "detailedIngredients": [
        "2 chicken breasts",
        "320g sheet all butter puff pastry",
        "150g garlic & herb cream cheese",
        "1/2 lemon",
        "1 tbsp olive oil",
        "200g mixed pack green beans and broccoli"
      ],
      "name": "Garlic chicken parcels",
      "description": "Heat oven to 220C/200C Fan/gas 7. Cut a slit halfway in each chicken breast, then put each one between two pieces of baking parchment and bash with a rolling pin to flatten slightly. Cut your sheet of pastry in half widthways and put both halves on a baking tray. Sit a chicken breast on top of each half, then cram the cavities with the cheese. Season, scatter over the lemon zest then fold the edges of the pastry in to the centre and pinch shut. Flip each parcel over so the seal is on the bottom. Brush with a little oil, then bake for 30 mins until deep golden. About 10 mins before your parcels are ready, steam or boil the greens until tender. Toss in the oil and season.  Serve alongside your chicken parcels with lemon wedges for squeezing over.",
      "time": "40 mins",
      "serves": "2",
      "imgSrc": "https://i0.wp.com/spicepaw.com/wp-content/uploads/2019/12/Chicken-and-Bacon-puffs-5.jpg"
    },
    {
      "ingredients": [
        "Ciabatta",
        "Chorizo",
        "Pesto",
        "Red pepper",
        "Rocket"
      ],
      "detailed Ingredients": [
        "2 small or 1 large ciabatta",
        "150g pack cooking chorizo",
        "75g pesto",
        "200g roasted red peppers",
        "handful rocket"
      ],
      "name": "Ultimate chorizo ciabatta",
      "description": "Heat oven to 180C/160C fan/gas 4 and put the ciabatta in to warm up. Put a griddle pan over a medium heat and cook the chorizo for 5 mins each side or until charred and cooked through. Open the warmed ciabatta and spread the pesto on the bottom. Layer with the red peppers, then the warm chorizo. Scatter over the rocket, sandwich the ciabatta together, cut in two and serve.",
      "time": "15 mins",
      "serves": "2",
      "imgSrc": "https: //images.immediate.co.uk/production/volatile/sites/30/2020/08/ultimate-chorizo-ciabatta-c3f006e.jpg"
    },
    {
      "ingredients": [
        "White sandwich bread",
        "Butter",
        "Sriracha",
        "Cheddar",
        "Kimchi"
      ],
      "detailed Ingredients": [
        "4 ½-thick slices white sandwich bread divided",
        "3 Tbsp. unsalted butter, room temperature, divided",
        "4 tsp. Sriracha divided",
        "1½ cups coarsely grated sharp cheddar divided",
        "½ cup drained coarsely chopped kimchi divided"
      ],
      "name": "Inside-Out kimchi grilled cheese",
      "description": "Place 2 bread slices on a work surface. Evenly spread ½ Tbsp. butter over each slice. Turn 1 slice over and spread 2 tsp. gochujang over, then top with ½ cup cheese and half the kimchi. Close sandwich with buttered sides facing out. Sprinkle 2 Tbsp. cheese over top of sandwich, gently pressing to adhere cheese to butter. Heat ½ Tbsp. butter in a medium nonstick skillet over medium-low until foaming. Cook sandwich, cheese side down (if some cheese falls out, use a heatproof spatula to nudge it back underneath the sandwich), gently pressing occasionally with a heatproof spatula, until underside is golden brown and crisp, about 3 minutes. Sprinkle another 2 Tbsp. cheese over top of sandwich, pressing with spatula to adhere. Turn sandwich over and cook until golden brown on second side and cheese inside is fully melted, about 3 minutes. Transfer sandwich to a plate. Wipe out skillet and repeat process with remaining ingredients to make 1 more sandwich.",
      "time": "15 mins",
      "serves": "2",
      "imgSrc": "https: //www.buffalomarket.com/hubfs/Imported_Blog_Media/kimichi_grilled_cheese_inside_out.jpg"
    },
    {
      "ingredients": [
        "Rice",
        "Tomato",
        "Butter",
        "Salt",
        "Water",
        "Lemon juice"
      ],
      "detailed Ingredients": [
        "1 bowl of rice",
        "2 diced tomatoes",
        "1 tbsp of butter",
        "1 tsp salt",
        "2 cups of boiling water",
        "3-4 drops of lemon juice"
      ],
      "name": "Rice with tomato",
      "description": "Wash 1 bowl of white rice, put it in a bowl, add salt, add 3-4 drops of lemon juice and add boiling water to it and leave it for 15-20 minutes.At the end of the waiting, drain the warm water of your rice into the sink and wash the drained rice under cold water (while the rice is in the strainer), set the washed rice aside with a strainer, and let the rice drain well in the strainer. While the rice is drained, wash and grate the tomatoes. Take your butter in your pan and melt it. Add your tomatoes to the melted oil. You will evaporate the juice of the tomatoes a little, the tomato will absorb the juice a little, and it will be cooked. The tomatoes have drained (half off) and now you will add 1.5 bowls of boiled water on top of the tomatoes with the bowl in which you measure the rice. Add your salt too. When the water in the pot boils, add your waiting filtered rice. Mix a little and close the lid of the pot. When the pot boils again, take it to your smallest stove and cook your rice.When the rice is cooked, close the bottom of the pot. Open the lid, cover the rice with a paper towel and let it sit like this for 5 minutes. Meanwhile, melt 2 tablespoons of butter in a saucepan and froth. Open the lid of the pot and take the paper towel. Spread the melted and foamed butter on your rice. Gently stir your rice. Serve your rice by pouring it into a bowl and turning it upside down on a serving plate. If you want, add black pepper on it, it will be more delicious.",
      "time": "45 mins",
      "serves": "2-4",
      "imgSrc": "https: //www.secondrecipe.com/wp-content/uploads/2020/01/tomato-rice.jpg"
    },
    {
      "ingredients": [
        "Chickpeas",
        "Water",
        "Onion",
        "Green pepper",
        "Tomato paste",
        "Olive oil"
      ],
      "detailed Ingredients": [
        "2.5 cups of boiled chickpeas",
        "4 glasses of water",
        "1 small onion",
        "1 green pepper",
        "1tbsp tomato paste",
        "2 tbsp olive oil"
      ],
      "name": "Chickpea",
      "description": "Boil the chickpeas and drain the water. We take olive oil in our pot, add the onions that we cut into cubes and fry. Add the finely chopped green pepper and tomato paste and fry for another 1-2 minutes. We add our water and let it boil. Add salt and pepper. We add the boiled chickpeas and cook on medium heat with the mouth closed. We cook for 35-45 minutes.",
      "time": "40 mins",
      "serves": "2-4",
      "imgSrc": "https: //silkroadrecipes.com/wp-content/uploads/2020/11/Turkish-Roasted-Chickpeas-square2.jpg"
    },
    {
      "ingredients": [
        "Water",
        "Green lentil",
        "Bulgur wheat",
        "Onion",
        "Tomato",
        "Chili paste",
        "Sugar",
        "Butter",
        "Salt",
        "Pepper"
      ],
      "detailed Ingredients": [
        "2 cups water (or chicken stock)",
        "1/2 (half) cup of green lentils",
        "1 cup of bulgur wheat",
        "1 bowl of rice",
        "1 tomato",
        "1 tsp of chili paste",
        "1 tsp of sugar",
        "1 tbsp of butter",
        "salt",
        "pepper"
      ],
      "name": "Lentil rice",
      "description": "Wash the lentils and cook them until they are almost cooked. Wash in cold water, drain and set aside. Chop the onion and tomato. Add olive oil to the pan and sweat the onions. Add tomato paste, bulgur, lentils and tomatoes in order. Add sugar salt pepper and add water. Close the lid and cook until the water evaporates. When ready, add 1 teaspoon of butter and mix. Put a napkin under the cover and let it rest.",
      "time": "30 mins",
      "serves": "4-6",
      "imgSrc": "https: //encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_QGJRr87Z-hBTJNOJ7uKZbh4qlmABmKRfBQ&usqp=CAU"
    },
    {
      "ingredients": [
        "Potato",
        "Olive oil",
        "Flour",
        "Maldon salt"
      ],
      "detailedIngredients": [
        "1kg Maris Piper potato",
        "100ml olive oil",
        "2 tsp flour",
        "Maldon salt to serve"
      ],
      "name": "Ultimate roast potatoes",
      "description": "Put a tray in the oven (one big enough to take the potatoes in a single layer) and heat oven to 200C/fan 180C/gas 6. The 1kg potatoes and cut each into 4 even-sized pieces if they are medium size,2-3 if smaller (5cm pieces). Drop the potatoes into a large and pour in enough water to barely cover them. Add salt, then wait for the water to boil. As soon as the water reaches a full rolling boil, lower the heat, put your timer on and simmer the potatoes uncovered, reasonably vigorously, for 2 mins. Meanwhile, put 100g duck or goose fat or 100ml olive oil into the hot roasting tin and heat it in the oven for a few mins, so it is hot.Drain the potatoes in a colander then shake the back and forth a few times to fluff up the outsides. Sprinkle with 2 tsp flour and give another shake or two so they are evenly and thinly coated. Carefully put the potatoes into the hot fat – they will sizzle as they go in then turn and roll them around, so they are coated all over. Spread them in a single layer making sure they have plenty of room. Roast the potatoes for 15 mins, then take them out of the oven and turn them over.Roast for another 15 mins and turn them over again. Put them back in the oven for another 10-20 mins, or however long it takes to get them golden and crisp. The coloring will be uneven, which is what you want. Scatter with Maldon salt and serve straight away.",
      "time": "30 mins",
      "serves": "4-6",
      "imgSrc": "https: //www.kitchensanctuary.com/wp-content/uploads/2019/04/Roast-potatoes-with-salt-and-fresh-thyme-leaves-wide-FS.jpg"
    },
    {
      "ingredients": [
        "Potato",
        "Onion",
        "Chili paste",
        "Oil",
        "Red pepper",
        "Salt",
        "Water"
      ],
      "detailedIngredients": [
        "3 potatoes",
        "1 onion",
        "2 tbsp of chili paste",
        "3 tbsp of oil",
        "1 tsp of red pepper flakes (optional)",
        "1 tsp salt",
        "Hot water"
      ],
      "name": "Potato meal",
      "description": "First we prepare the hot water. Then we chop the onion finely and add the oil and fry it. When it turns pink, we add the tomato paste and continue to fry.Then add the potato, chili pepper, salt, add water and wait for it to cook.",
      "time": "40 mins",
      "serves": "4-6",
      "imgSrc": "https: //i4.hurimg.com/i/hurriyet/75/750x422/60e2fba34e3fdf189c3b27d7.jpg"
    },
    {
      "ingredients": [
        "Spinach",
        "Egg",
        "Salt",
        "Black pepper",
        "Chili pepper",
        "Red pepper",
        "Oil",
        "Tomato paste",
        "Onion"
      ],
      "detailedIngredients": [
        "½ kg spinach",
        "3-4 eggs",
        "Salt",
        "Black pepper",
        "Chili pepper",
        "Red pepper",
        "2-3 tbsp of oil",
        "1.5 tbsp of tomato paste",
        "1 medium onion"
      ],
      "name": "Spinach with egg",
      "description": "Remove the roots of the spinach and wash it with plenty of water. Put it in a pot and boil it lightly without pouring water on it. Take oil in a large pan and fry the small, chopped onion in oil. Add the paste. Then take the spinach in a colander (don't squeeze the water, it will be more delicious when there is little water when you take it through the colander.) and fry the spinach lightly. Adjust the salt and spice, open 4 eyes on it and break the eggs into the gaps. After adding salt and red pepper on the eggs, close the lid of the pan and keep it on the fire until the egg whites are cooked.",
      "time": "40 mins",
      "serves": "2-4",
      "imgSrc": "https: //assets.epicurious.com/photos/59a6d5c7c780b269cc9df848/2:1/w_1199,h_599,c_limit/scrambled-eggs-with-spinach-and-parmesan-recipe-BA-083017.jpg"
    },
    {
      "ingredients": [
        "Chicken legs",
        "Vermicelli",
        "Salt",
        "Black pepper",
        "Red pepper",
        "Water",
        "Lemon"
      ],
      "detailedIngredients": [
        "2 chicken legs",
        "1 glass of vermicelli",
        "1 teaspoon salt",
        "1 teaspoon black pepper",
        "1 teaspoon red pepper flakes",
        "2 liters of water",
        "1 lemon"
      ],
      "name": "Chicken soup",
      "description": "Wash the chickens and leave them to boil in 2 liters of water. When the water boils, let's get the foam on it so that our soup is bright, not cloudy. Let's take the chicken that boils for 20 minutes from the pot and let it cool, while we add salt, black pepper, and chili pepper to the water. Let's add the noodle to the water and bring the bottom of the pot to the lowest, meanwhile, let's finely chop the cooled chicken and add it to our soup. Serve with a squeeze of lemon.",
      "time": "35 mins",
      "serves": "2-4",
      "imgSrc": "https: //www.seriouseats.com/thmb/2nouHHsjM0bN1vwXMOZGUkLFsJ8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__12__20171115-chicken-soup-vicky-wasik-11-80db1a04d84a43a089e0559efdddd517.jpg"
    },
    {
      "ingredients": [
        "Onion",
        "Tomato",
        "Chili pepper",
        "Salt",
        "Black pepper",
        "Margarine",
        "Egg"
      ],
      "detailedIngredients": [
        "1 medium onion",
        "3 medium tomatoes",
        "3 green chili peppers",
        "2 tsp of salt",
        "1 tsp of black pepper",
        "2 tbsp of margarine",
        "3 eggs"
      ],
      "name": "Menemen",
      "description": "Let's chop the onion finely and add the oil and onion to our heated pan. After frying for 2 minutes, add the finely chopped peppers and fry for two more minutes. Let's add the tomatoes that we peeled and chopped, let's throw the salt and cook for 7-8 minutes with the lid closed. When the tomatoes start to melt, let's throw the black pepper and mix it. Let's cut the bottom of the pan and break the eggs. Let's close the lid again and cook for 2-3 minutes.",
      "time": "15 mins",
      "serves": "2-4",
      "imgSrc": "https: //www.google.com/url?sa=i&url=https%3A%2F%2Fyemek.com%2Ftarif%2Fdomates-biber-soganli-menemen%2F&psig=AOvVaw0xEecYQFGsS4Cd9tWumvYq&ust=1670411036948000&source=images&cd=vfe&ved=0CBAQjRxqFwoTCNDjmpns5PsCFQAAAAAdAAAAABAN"
    },
    {
      "ingredients": [
        "Sandwich buns",
        "Tuna fish",
        "Pickle",
        "Corn",
        "Mayonnaise",
        "Lettuce",
        "Onion",
        "Tomato"
      ],
      "detailedIngredients": [
        "2 sandwich buns",
        "2 canned tuna fish",
        "5 pickles",
        "1 cup canned corn",
        "Mayonnaise",
        "4 leaves of lettuce",
        "1 small onion",
        "1 medium tomato"
      ],
      "name": "Tuna Sandwich",
      "description": "We take the tuna fish and mayonnaise into a bowl. Finely chop the pickled gherkins, put them in a bowl with the corn and mix them. We chop the onion and lettuce julienne and mix them together. We cut the tomato in half a moon shape and move on to preparing the sandwich. We take the sandwich breads and put the tuna mixture first. We spread the tuna fish and arrange the onions and then the tomatoes on it. The tuna sandwich is now ready to be served.",
      "time": "10 mins",
      "serves": "1",
      "imgSrc": "https: //images-gmi-pmc.edge-generalmills.com/7eb09e32-fb06-4a34-97e6-def91b62164f.jpg"
    },
    {
      "ingredients": [
        "Sandwich bread",
        "Labneh",
        "Feta cheese",
        "Tomato"
      ],
      "detailedIngredients": [
        "1 sandwich bread",
        "labneh",
        "feta cheese",
        "1 medium size tomato"
      ],
      "name": "Cheese Sandwich",
      "description": "Cut the sandwich bread with enough clearance to accommodate the ingredients. Separating it completely from the middle will cause your materials to fall. First, spread the labneh into your bread to hold the ingredients. Then place the white cheese in a thin slice. After washing and peeling the tomatoes, place the tomato slices on the cheese. If you like a bitter taste depending on your preference, you can sprinkle chili pepper on it. Goes well with tomatoes and cheese.",
      "time": "10 mins",
      "serves": "1",
      "imgSrc": "https: //www.wikihow.com/images/f/f9/Make-a-Cheese-Sandwich-Step-21-Version-2.jpg"
    },
    {
      "ingredients": [
        "Chicken thigh",
        "Soy sauce",
        "Olive oil",
        "Rosemary",
        "Salt",
        "Black pepper"
      ],
      "detailed Ingredients": [
        "3 pieces boneless chicken thigh",
        "1 tbsp of soy sauce",
        "3 tbsp of olive oil",
        "Rosemary",
        "Salt",
        "Black pepper"
      ],
      "name": "Chicken Wrap",
      "description": "For our vegetable saute, we divide the zucchini into 4 equal parts. We finely chop it. In the same way, we cut the carrot in the size of the zucchini. We chop our red and green peppers just like carrots. We take onions and carrots into the pan. We put our olive oil on it and saute it. While our onions turn pink, we add a little vinegar into it. We add our peppers on top of the carrots and saute a little bit like that. We put the zucchini and the garlic, which we will finely chop, and sauté for 5 minutes. When it softens, take it out of the pan. We chop our chickens in finger thickness. After blending the spices, we put them in the pan where we put olive oil. Cook on medium heat until it turns color. When we get it, we take it from the stove. We put our lavash bread on the counter and put some of the vegetable mortar we prepared in the middle. We make wraps by folding the edges of the lavash into it. After doing the same for the others, you can serve it with a salad or with small french fries.",
      "time": "30 mins",
      "serves": "3",
      "imgSrc": "https: //www.licious.in/blog/wp-content/uploads/2020/12/Chicken-Wrap.jpg"
    },
    {
      "ingredients": [
        "Olive oil",
        "Bacon",
        "Onion",
        "Celery stick",
        "Carrot",
        "Garlic cloves",
        "Beef",
        "Tomato paste",
        "Tomato",
        "Honey",
        "Lasagne sheets",
        "Creme",
        "Mozzarella",
        "Parmesan",
        "Basil leaves"
      ],
      "detailedIngredients": [
        "1 tbsp olive oil",
        "2 rashers smoked streaky bacon",
        "1 onion, finely chopped",
        "1 celery stick, finely chopped",
        "1 medium carrot, grated",
        "2 garlic cloves, finely chopped",
        "500g beef mince",
        "1 tbsp tomato purée",
        "2x 400g cans chopped tomatoes",
        "1 tbsp clear honey",
        "500g pack fresh egg lasagne sheets",
        "400ml crème fraîche",
        "125g ball mozzarella, roughly torn",
        "50g freshly grated parmesan",
        "large handful basil leaves, torn (optional)"
      ],
      "name": "Easy Classic Lasagne",
      "description": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened. Add the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over. Stir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins. Heat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta. Put the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil if you like.",
      "Time": "1 hr 15 mins",
      "werves": "4-6",
      "imgSrc": "https: //images.immediate.co.uk/production/volatile/sites/30/2020/08/classic-lasange-4a66137.jpg"
    },
    {
      "ingredients": [
        "Cauliflower",
        "Cornflour",
        "Milk",
        "Mustard",
        "Thyme",
        "Cheddar",
        "Butter"
      ],
      "detailedIngredients": [
        "1 large cauliflower",
        "2½ tbsp cornflour",
        "300ml whole milk",
        "1½ tsp English mustard",
        "small bunch of thyme, leaves picked",
        "150g mature cheddar, grated, plus a little extra (optional)",
        "25g butter"
      ],
      "name": "Microwave cauliflower cheese",
      "description": "Cut the cauliflower into bite-sized pieces. Reserve the leaves, except any tough ones. Put the stalk pieces in a microwave-safe bowl, then the florets. Add 1 tbsp water and cover. Microwave for 8 mins until tender, then remove and drain, if needed. Transfer the cauliflower to another microwave-safe dish. Tip the cornflour and a splash of the milk into the bowl used to cook the cauliflower, and mix to a smooth paste. Whisk in the rest of the milk. Season. Stir in the mustard, thyme and cheddar, then pour this over the cauliflower. Top with the cauliflower leaves and dot over the butter. Microwave on high for 5 mins until the cauliflower is tender and the cheese has melted. Will keep chilled for up to 24 hours. Leave to cool first. Sprinkle with a little extra cheese, if you like, and finish under a grill or in a combi microwave until golden.",
      "time": "25 mins",
      "serves": "6",
      "imgSrc": "https: //images.immediate.co.uk/production/volatile/sites/30/2022/10/Microwave-cauliflower-cheese-e37b9ef.jpg"
    },
    {
      "ingredients": [
        "Flour",
        "Egg",
        "Milk",
        "Olive oil"
      ],
      "detailedIngredients": [
        "100g plain flour",
        "2 large eggs",
        "300ml milk",
        "1 tbsp sunflower or vegetable oil, plus a little extra for frying",
        "lemon wedges to serve (optional)",
        "caster sugar to serve (optional)"
      ],
      "name": "Pancake",
      "description": " Put 100g plain flour, 2 large eggs, 300ml milk, 1 tbsp sunflower or vegetable oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter.Set aside for 30 mins to rest if you have time, or start cooking straight away.Set a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper.When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go.Serve with lemon wedges and caster sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months.",
      "time": "30 mins",
      "serves": "12",
      "imgSrc": "https: //images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1273477_8-ad36e3b.jpg?quality=90&resize=440,400"
    },
    {
      "ingredients": [
        "Spring onion",
        "Garlic",
        "Red chili",
        "Cannellini beans",
        "Butter beans",
        "Olive oil",
        "White wine vinegar",
        "Parsley"
      ],
      "detailedIngredients": [
        "1 bunch spring onions",
        "2 garlic cloves, crushed",
        "1 red chili, seeded and finely chopped",
        "2 x 400g cans cannellini beans, drained and rinsed",
        "1 can of butter beans",
        "6 tbsp olive oil",
        "2 tbsp white wine vinegar",
        "plenty of chopped parsley"
      ],
      "name": "Easy Italian Bean Salad",
      "description": "Finely chop the spring onions and put into a bowl with the garlic and the chilli. Mix in the cannellini beans and the butter beans. Whisk the olive oil with the white wine vinegar and add plenty of seasoning. Stir through the salad with plenty of chopped parsley.",
      "time": "10 mins",
      "serves": "8",
      "imgSrc": "https: //images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-4274_11-96cd839.jpg?quality=90&resize=440,400"
    },
    {
      "ingredients": [
        "Bacon",
        "Onion",
        "Butter",
        "Risotto rice",
        "White wine",
        "Tomato",
        "Chicken stock",
        "Parmesan"
      ],
      "detailedIngredients": [
        "250g pack smoked bacon, chopped into small pieces",
        "1 onion, chopped",
        "25g butter",
        "300g risotto rice",
        "half a glass of white wine (optional)",
        "150g pack cherry tomatoes, halved",
        "700ml hot chicken stock (from a cube is fine)",
        "50g parmesan, grated"
      ],
      "name": "Oven-baked Risotto",
      "description": "Heat oven to 200C/fan 180C/gas 6. Fry the bacon pieces in an ovenproof pan or casserole dish for 3-5 mins until golden and crisp. Stir in the onion and butter and cook for 3-4 mins until soft. Tip in the rice and mix well until coated. Pour over the wine if using and cook for 2 mins until absorbed. Add the cherry tomatoes and the hot stock, then give the rice a quick stir. Cover with a tightly fitting lid and bake for 18 mins until just cooked. Stir through most of the parmesan and serve sprinkled with the remainder.",
      "time": "35 mins",
      "serves": "4",
      "imgSrc": "http: //www.perfectitaliano.com.au/content/dam/perfectitaliano-aus/recipe/0_desktop/Desktop-Baked-Chicken-Mushroom-Risotto.jpg"
    }
  ]
}